'''
Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. 
Она растет на круглой грядке, причем кусты высажены только по окружности. 
Таким образом, укаждого куста есть ровно два соседних. Всего на грядке растет N кустов.
Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них выросло различное число ягод 
– на i-ом кусте выросло ai ягод.В этом фермерском хозяйстве внедрена 
система автоматического сбора черники. Эта система состоит из управляющего модуля и 
нескольких собирающих модулей. 
Собирающий модуль за один заход, находясь непосредственно перед некоторымкустом, 
собирает ягоды с этого куста и с двух соседних с ним. Напишите программу для нахождения 
максимального числа ягод, которое может собрать за один заход собирающий модуль, находясь 
перед некоторым кустом заданной во входном файле грядки.

Пример:
4 -> 1 2 3 4
9
'''

import random

size = int(input('Enter the number of N bushes in the garden: '))
garden = [random.randint(1, 9) for i in range(size)]
print(*garden)

harvest = list()

for i in range(len(garden)):
    harvest.append(garden[i - 2] + garden[i - 1] + garden[i])
print(max(harvest))